quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Чему не обучают в онлайн-школе Pixel для детей с 11 до 17 лет',
        'options': ['Чат-бот ТГ через quiz', 'Нейронным сетям', '"ООП" на python', 'Работе с Blender'],
        'correct_option': 1
    },
    {
        'question': 'Что присутсвует в программе обучения одной "академии" для обучения детей программированию?',
        'options': ['Машинное обучеия с методами борьбы с переобучением', 'Модуль PyGame', 'Работа с модулем Tkniter'],
        'correct_option': 0
    },
    {
        'question': 'Много ли воды в тексте статьи урока 12?',
        'options': ['Да','Нет'],
        'correct_option': 0
    },
    {
        'question': 'Можно ли было вынести небольшой блок по bd в отдельную часть как асинхронку чтобы скипнуть?',
        'options': ['Да'],
        'correct_option': 0
    },
    {
        'question': 'Устал ли я придумывать вопросы?',
        'options': ['Да'],
        'correct_option': 0
    },
    {
        'question': 'Какова причина этого задания?',
        'options': ['Да'],
        'correct_option': 0
    },
    {
        'question': 'Жду ли я ответа на предыдущий вопрос в фидбэке на дз?',
        'options': ['Да', 'Нет'],
        'correct_option': 1
    },
    {
        'question': 'Что можно было бы добавить в комментарий по изменению по архитектуре этого проекта?',
        'options': ['MV*', 'Flux', 'Clean Architecture', 'Ничего'],
        'correct_option': 3
    },
]